"use strict";

// 1. Вивод парних чисел
// Напишіть код який бере значення від користувача (prompt) і виводить у консоль всі парні числа, що менші за задане. Наприклад, якщо користувач ввів число 10, програма має вивести наступне: 2, 4, 6, 8. Додаткові вимоги:
// Реалізуйте рішення 2 способами: з використанням циклу for та whileКод має перевіряти, чи значення у змінній є числом. Якщо воно не є числом, програма має вивести повідомлення про помилку.

// let message = prompt("Введіть власне число ");

// let number = parseInt(message);

// Цикл for
// if (!isNaN(number)) {
//     for (let i = 0; i <= number; i += 2) {
//         console.log(i);
//     }
// } else {
//     console.log("Введіть число");
// }

// Цикл while 
// if (!isNaN(number)){
//     let i = 0;
//     while (i <= number){
//         console.log(i);
//         i += 2;
//     }
// } else {
//         console.log("Введіть число");
// }


// 2. Задача FizzBuzz
// Напишіть код який виводить в консоль значення від 1 до 100, але замість чисел кратних 3 має виводитись Fizz, замість значень кратних 5 - Buzz, а замість значень кратних і 3 і 5 - FizzBuzz.

// let i;
// for (i = 1; i < 101; i ++){
//     if (i % 3 === 0 && i % 5 === 0){
//         console.log("FizzBuzz");
//     } else if (i % 3 === 0){
//         console.log("Fizz");
//     } else if (i % 5 === 0){
//         console.log("Buzz");
//     } else {
//         console.log(i);
//     }
// }

// 3. Додаткова задача*

// Маючи рядок цифр, ви повинні замінити будь-яку цифру нижче 5 на «0», а будь-яку цифру 5 і вище на «1».
